# CannotCreateCorniceIntegralWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateCorniceIntegralWarn Property
BuiltInFailures..::..CreationFailures Class See Also
---
Could not create integral wall sweep for wall instance. [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateCorniceIntegralWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateCorniceIntegralWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateCorniceIntegralWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace